{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "2.0.0 - 3.0.0"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp"
    },
    "blink.lib": {
      "src": "https://github.com/saghen/blink.lib"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "diffview.nvim": {
      "src": "https://github.com/sindrets/diffview.nvim"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "guess-indent.nvim": {
      "src": "https://github.com/NMAC427/guess-indent.nvim"
    },
    "kulala.nvim": {
      "src": "https://github.com/mistweaverco/kulala.nvim"
    },
    "lua-async-await": {
      "src": "https://github.com/nvim-java/lua-async-await",
      "version": "'v1.1.0'"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim"
    },
    "mason-nvim-dap.nvim": {
      "src": "https://github.com/jay-babu/mason-nvim-dap.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim"
    },
    "minuet-ai.nvim": {
      "src": "https://github.com/milanglacier/minuet-ai.nvim"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim"
    },
    "neogit": {
      "src": "https://github.com/NeogitOrg/neogit"
    },
    "neotest": {
      "src": "https://github.com/nvim-neotest/neotest"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-java": {
      "src": "https://github.com/nvim-java/nvim-java",
      "version": "'v4.1.0'"
    },
    "nvim-java-core": {
      "src": "https://github.com/nvim-java/nvim-java-core",
      "version": "'v2.0.0'"
    },
    "nvim-java-dap": {
      "src": "https://github.com/nvim-java/nvim-java-dap",
      "version": "'v1.0.0'"
    },
    "nvim-java-test": {
      "src": "https://github.com/nvim-java/nvim-java-test",
      "version": "'v1.0.1'"
    },
    "nvim-jdtls": {
      "src": "https://github.com/mfussenegger/nvim-jdtls"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "spring-boot.nvim": {
      "src": "https://github.com/JavaHello/spring-boot.nvim"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope-ui-select.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-ui-select.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
